GopalSaraf/Practicals/PSDL/include/proc/pic18f67j11.inc
// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0FB2h

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0FB3h

// Register: ECCP3DEL
#define ECCP3DEL ECCP3DEL
ECCP3DEL                                 equ 0FB4h
// bitfield definitions
ECCP3DEL_PDC_POSN                        equ 0000h
ECCP3DEL_PDC_POSITION                    equ 0000h
ECCP3DEL_PDC_SIZE                        equ 0007h
ECCP3DEL_PDC_LENGTH                      equ 0007h
ECCP3DEL_PDC_MASK                        equ 007Fh
ECCP3DEL_PRSEN_POSN                      equ 0007h
ECCP3DEL_PRSEN_POSITION                  equ 0007h
ECCP3DEL_PRSEN_SIZE                      equ 0001h
ECCP3DEL_PRSEN_LENGTH                    equ 0001h
ECCP3DEL_PRSEN_MASK                      equ 0080h
ECCP3DEL_PDC0_POSN                       equ 0000h
ECCP3DEL_PDC0_POSITION                   equ 0000h
ECCP3DEL_PDC0_SIZE                       equ 0001h
ECCP3DEL_PDC0_LENGTH                     equ 0001h
ECCP3DEL_PDC0_MASK                       equ 0001h
ECCP3DEL_PDC1_POSN                       equ 0001h
ECCP3DEL_PDC1_POSITION                   equ 0001h
ECCP3DEL_PDC1_SIZE                       equ 0001h
ECCP3DEL_PDC1_LENGTH                     equ 0001h
ECCP3DEL_PDC1_MASK                       equ 0002h
ECCP3DEL_PDC2_POSN                       equ 0002h
ECCP3DEL_PDC2_POSITION                   equ 0002h
ECCP3DEL_PDC2_SIZE                       equ 0001h
ECCP3DEL_PDC2_LENGTH                     equ 0001h
ECCP3DEL_PDC2_MASK                       equ 0004h
ECCP3DEL_PDC3_POSN                       equ 0003h
ECCP3DEL_PDC3_POSITION                   equ 0003h
ECCP3DEL_PDC3_SIZE                       equ 0001h
ECCP3DEL_PDC3_LENGTH                     equ 0001h
ECCP3DEL_PDC3_MASK                       equ 0008h
ECCP3DEL_PDC4_POSN                       equ 0004h
ECCP3DEL_PDC4_POSITION                   equ 0004h
ECCP3DEL_PDC4_SIZE                       equ 0001h
ECCP3DEL_PDC4_LENGTH                     equ 0001h
ECCP3DEL_PDC4_MASK                       equ 0010h
ECCP3DEL_PDC5_POSN                       equ 0005h
ECCP3DEL_PDC5_POSITION                   equ 0005h
ECCP3DEL_PDC5_SIZE                       equ 0001h
ECCP3DEL_PDC5_LENGTH                     equ 0001h
ECCP3DEL_PDC5_MASK                       equ 0020h
ECCP3DEL_PDC6_POSN                       equ 0006h
ECCP3DEL_PDC6_POSITION                   equ 0006h
ECCP3DEL_PDC6_SIZE                       equ 0001h
ECCP3DEL_PDC6_LENGTH                     equ 0001h
ECCP3DEL_PDC6_MASK                       equ 0040h
ECCP3DEL_P3DC0_POSN                      equ 0000h
ECCP3DEL_P3DC0_POSITION                  equ 0000h
ECCP3DEL_P3DC0_SIZE                      equ 0001h
ECCP3DEL_P3DC0_LENGTH                    equ 0001h
ECCP3DEL_P3DC0_MASK                      equ 0001h
ECCP3DEL_P3DC1_POSN                      equ 0001h
ECCP3DEL_P3DC1_POSITION                  equ 0001h
ECCP3DEL_P3DC1_SIZE                      equ 0001h
ECCP3DEL_P3DC1_LENGTH                    equ 0001h
ECCP3DEL_P3DC1_MASK                      equ 0002h
ECCP3DEL_P3DC2_POSN                      equ 0002h
ECCP3DEL_P3DC2_POSITION                  equ 0002h
ECCP3DEL_P3DC2_SIZE                      equ 0001h
ECCP3DEL_P3DC2_LENGTH                    equ 0001h
ECCP3DEL_P3DC2_MASK                      equ 0004h
ECCP3DEL_P3DC3_POSN                      equ 0003h
ECCP3DEL_P3DC3_POSITION                  equ 0003h
ECCP3DEL_P3DC3_SIZE                      equ 0001h
ECCP3DEL_P3DC3_LENGTH                    equ 0001h
ECCP3DEL_P3DC3_MASK                      equ 0008h
ECCP3DEL_P3DC4_POSN                      equ 0004h
ECCP3DEL_P3DC4_POSITION                  equ 0004h
ECCP3DEL_P3DC4_SIZE                      equ 0001h
ECCP3DEL_P3DC4_LENGTH                    equ 0001h
ECCP3DEL_P3DC4_MASK                      equ 0010h
ECCP3DEL_P3DC5_POSN                      equ 0005h
ECCP3DEL_P3DC5_POSITION                  equ 0005h
ECCP3DEL_P3DC5_SIZE                      equ 0001h
ECCP3DEL_P3DC5_LENGTH                    equ 0001h
ECCP3DEL_P3DC5_MASK                      equ 0020h
ECCP3DEL_P3DC6_POSN                      equ 0006h
ECCP3DEL_P3DC6_POSITION                  equ 0006h
ECCP3DEL_P3DC6_SIZE                      equ 0001h
ECCP3DEL_P3DC6_LENGTH                    equ 0001h
ECCP3DEL_P3DC6_MASK                      equ 0040h
ECCP3DEL_P3RSEN_POSN                     equ 0007h
ECCP3DEL_P3RSEN_POSITION                 equ 0007h
ECCP3DEL_P3RSEN_SIZE                     equ 0001h
ECCP3DEL_P3RSEN_LENGTH                   equ 0001h
ECCP3DEL_P3RSEN_MASK                     equ 0080h

// Register: ECCP3AS
#define ECCP3AS ECCP3AS
ECCP3AS                                  equ 0FB5h
// bitfield definitions
ECCP3AS_PSSBD_POSN                       equ 0000h
ECCP3AS_PSSBD_POSITION                   equ 0000h
ECCP3AS_PSSBD_SIZE                       equ 0002h
ECCP3AS_PSSBD_LENGTH                     equ 0002h
ECCP3AS_PSSBD_MASK                       equ 0003h
ECCP3AS_PSSAC_POSN                       equ 0002h
ECCP3AS_PSSAC_POSITION                   equ 0002h
ECCP3AS_PSSAC_SIZE                       equ 0002h
ECCP3AS_PSSAC_LENGTH                     equ 0002h
ECCP3AS_PSSAC_MASK                       equ 000Ch
ECCP3AS_ECCPAS_POSN                      equ 0004h
ECCP3AS_ECCPAS_POSITION                  equ 0004h
ECCP3AS_ECCPAS_SIZE                      equ 0003h
ECCP3AS_ECCPAS_LENGTH                    equ 0003h
ECCP3AS_ECCPAS_MASK                      equ 0070h
ECCP3AS_ECCPASE_POSN                     equ 0007h
ECCP3AS_ECCPASE_POSITION                 equ 0007h
ECCP3AS_ECCPASE_SIZE                     equ 0001h
ECCP3AS_ECCPASE_LENGTH                   equ 0001h
ECCP3AS_ECCPASE_MASK                     equ 0080h
ECCP3AS_PSSBD0_POSN                      equ 0000h
ECCP3AS_PSSBD0_POSITION                  equ 0000h
ECCP3AS_PSSBD0_SIZE                      equ 0001h
ECCP3AS_PSSBD0_LENGTH                    equ 0001h
ECCP3AS_PSSBD0_MASK                      equ 0001h
ECCP3AS_PSSBD1_POSN                      equ 0001h
ECCP3AS_PSSBD1_POSITION                  equ 0001h
ECCP3AS_PSSBD1_SIZE                      equ 0001h
ECCP3AS_PSSBD1_LENGTH                    equ 0001h
ECCP3AS_PSSBD1_MASK                      equ 0002h
ECCP3AS_PSSAC0_POSN                      equ 0002h
ECCP3AS_PSSAC0_POSITION                  equ 0002h
ECCP3AS_PSSAC0_SIZE                      equ 0001h
ECCP3AS_PSSAC0_LENGTH                    equ 0001h
ECCP3AS_PSSAC0_MASK                      equ 0004h
ECCP3AS_PSSAC1_POSN                      equ 0003h
ECCP3AS_PSSAC1_POSITION                  equ 0003h
ECCP3AS_PSSAC1_SIZE                      equ 0001h
ECCP3AS_PSSAC1_LENGTH                    equ 0001h
ECCP3AS_PSSAC1_MASK                      equ 0008h
ECCP3AS_ECCPAS0_POSN                     equ 0004h
ECCP3AS_ECCPAS0_POSITION                 equ 0004h
ECCP3AS_ECCPAS0_SIZE                     equ 0001h
ECCP3AS_ECCPAS0_LENGTH                   equ 0001h
ECCP3AS_ECCPAS0_MASK                     equ 0010h
ECCP3AS_ECCPAS1_POSN                     equ 0005h
ECCP3AS_ECCPAS1_POSITION                 equ 0005h
ECCP3AS_ECCPAS1_SIZE                     equ 0001h
ECCP3AS_ECCPAS1_LENGTH                   equ 0001h
ECCP3AS_ECCPAS1_MASK                     equ 0020h
ECCP3AS_ECCPAS2_POSN                     equ 0006h
ECCP3AS_ECCPAS2_POSITION                 equ 0006h
ECCP3AS_ECCPAS2_SIZE                     equ 0001h
ECCP3AS_ECCPAS2_LENGTH                   equ 0001h
ECCP3AS_ECCPAS2_MASK                     equ 0040h
ECCP3AS_PSS3BD0_POSN                     equ 0000h
ECCP3AS_PSS3BD0_POSITION                 equ 0000h
ECCP3AS_PSS3BD0_SIZE                     equ 0001h
ECCP3AS_PSS3BD0_LENGTH                   equ 0001h
ECCP3AS_PSS3BD0_MASK                     equ 0001h
ECCP3AS_PSS3BD1_POSN                     equ 0001h
ECCP3AS_PSS3BD1_POSITION                 equ 0001h
ECCP3AS_PSS3BD1_SIZE                     equ 0001h
ECCP3AS_PSS3BD1_LENGTH                   equ 0001h
ECCP3AS_PSS3BD1_MASK                     equ 0002h
ECCP3AS_PSS3AC0_POSN                     equ 0002h
ECCP3AS_PSS3AC0_POSITION                 equ 0002h
ECCP3AS_PSS3AC0_SIZE                     equ 0001h
ECCP3AS_PSS3AC0_LENGTH                   equ 0001h
ECCP3AS_PSS3AC0_MASK                     equ 0004h
ECCP3AS_PSS3AC1_POSN                     equ 0003h
ECCP3AS_PSS3AC1_POSITION                 equ 0003h
ECCP3AS_PSS3AC1_SIZE                     equ 0001h
ECCP3AS_PSS3AC1_LENGTH                   equ 0001h
ECCP3AS_PSS3AC1_MASK                     equ 0008h
ECCP3AS_ECCP3AS0_POSN                    equ 0004h
ECCP3AS_ECCP3AS0_POSITION                equ 0004h
ECCP3AS_ECCP3AS0_SIZE                    equ 0001h
ECCP3AS_ECCP3AS0_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS0_MASK                    equ 0010h
ECCP3AS_ECCP3AS1_POSN                    equ 0005h
ECCP3AS_ECCP3AS1_POSITION                equ 0005h
ECCP3AS_ECCP3AS1_SIZE                    equ 0001h
ECCP3AS_ECCP3AS1_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS1_MASK                    equ 0020h
ECCP3AS_ECCP3AS2_POSN                    equ 0006h
ECCP3AS_ECCP3AS2_POSITION                equ 0006h
ECCP3AS_ECCP3AS2_SIZE                    equ 0001h
ECCP3AS_ECCP3AS2_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS2_MASK                    equ 0040h
ECCP3AS_ECCP3ASE_POSN                    equ 0007h
ECCP3AS_ECCP3ASE_POSITION                equ 0007h
ECCP3AS_ECCP3ASE_SIZE                    equ 0001h
ECCP3AS_ECCP3ASE_LENGTH                  equ 0001h
ECCP3AS_ECCP3ASE_MASK                    equ 0080h

// Register: ECCP2CON
#define ECCP2CON ECCP2CON
ECCP2CON                                 equ 0FB6h
// bitfield definitions
ECCP2CON_CCP2M_POSN                      equ 0000h
ECCP2CON_CCP2M_POSITION                  equ 0000h
ECCP2CON_CCP2M_SIZE                      equ 0004h
ECCP2CON_CCP2M_LENGTH                    equ 0004h
ECCP2CON_CCP2M_MASK                      equ 000Fh
ECCP2CON_DC2B_POSN                       equ 0004h
ECCP2CON_DC2B_POSITION                   equ 0004h
ECCP2CON_DC2B_SIZE                       equ 0002h
ECCP2CON_DC2B_LENGTH                     equ 0002h
ECCP2CON_DC2B_MASK                       equ 0030h
ECCP2CON_P2M_POSN                        equ 0006h
ECCP2CON_P2M_POSITION                    equ 0006h
ECCP2CON_P2M_SIZE                        equ 0002h
ECCP2CON_P2M_LENGTH                      equ 0002h
ECCP2CON_P2M_MASK                        equ 00C0h
ECCP2CON_CCP2M0_POSN                     equ 0000h
ECCP2CON_CCP2M0_POSITION                 equ 0000h
ECCP2CON_CCP2M0_SIZE                     equ 0001h
ECCP2CON_CCP2M0_LENGTH                   equ 0001h
ECCP2CON_CCP2M0_MASK                     equ 0001h
ECCP2CON_CCP2M1_POSN                     equ 0001h
ECCP2CON_CCP2M1_POSITION                 equ 0001h
ECCP2CON_CCP2M1_SIZE                     equ 0001h
ECCP2CON_CCP2M1_LENGTH                   equ 0001h
ECCP2CON_CCP2M1_MASK                     equ 0002h
ECCP2CON_CCP2M2_POSN                     equ 0002h
ECCP2CON_CCP2M2_POSITION                 equ 0002h
ECCP2CON_CCP2M2_SIZE                     equ 0001h
ECCP2CON_CCP2M2_LENGTH                   equ 0001h
ECCP2CON_CCP2M2_MASK                     equ 0004h
ECCP2CON_CCP2M3_POSN                     equ 0003h
ECCP2CON_CCP2M3_POSITION                 equ 0003h
ECCP2CON_CCP2M3_SIZE                     equ 0001h
ECCP2CON_CCP2M3_LENGTH                   equ 0001h
ECCP2CON_CCP2M3_MASK                     equ 0008h
ECCP2CON_DC2B0_POSN                      equ 0004h
ECCP2CON_DC2B0_POSITION                  equ 0004h
ECCP2CON_DC2B0_SIZE                      equ 0001h
ECCP2CON_DC2B0_LENGTH                    equ 0001h
ECCP2CON_DC2B0_MASK                      equ 0010h
ECCP2CON_DC2B1_POSN                      equ 0005h
ECCP2CON_DC2B1_POSITION                  equ 0005h
ECCP2CON_DC2B1_SIZE                      equ 0001h
ECCP2CON_DC2B1_LENGTH                    equ 0001h
ECCP2CON_DC2B1_MASK                      equ 0020h
ECCP2CON_P2M0_POSN                       equ 0006h
ECCP2CON_P2M0_POSITION                   equ 0006h
ECCP2CON_P2M0_SIZE                       equ 0001h
ECCP2CON_P2M0_LENGTH                     equ 0001h
ECCP2CON_P2M0_MASK                       equ 0040h
ECCP2CON_P2M1_POSN                       equ 0007h
ECCP2CON_P2M1_POSITION                   equ 0007h
ECCP2CON_P2M1_SIZE                       equ 0001h
ECCP2CON_P2M1_LENGTH                     equ 0001h
ECCP2CON_P2M1_MASK                       equ 0080h
ECCP2CON_CCP2Y_POSN                      equ 0004h
ECCP2CON_CCP2Y_POSITION                  equ 0004h
ECCP2CON_CCP2Y_SIZE                      equ 0001h
ECCP2CON_CCP2Y_LENGTH                    equ 0001h
ECCP2CON_CCP2Y_MASK                      equ 0010h
ECCP2CON_CCP2X_POSN                      equ 0005h
ECCP2CON_CCP2X_POSITION                  equ 0005h
ECCP2CON_CCP2X_SIZE                      equ 0001h
ECCP2CON_CCP2X_LENGTH                    equ 0001h
ECCP2CON_CCP2X_MASK                      equ 0020h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 0FB7h

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0FB7h

