GopalSaraf/Practicals/PSDL/include/proc/pic18f67j11.inc
// Register: SSP1BUF
#define SSP1BUF SSP1BUF
SSP1BUF                                  equ 0FC9h

// Register: T2CON
#define T2CON T2CON
T2CON                                    equ 0FCAh
// bitfield definitions
T2CON_T2CKPS_POSN                        equ 0000h
T2CON_T2CKPS_POSITION                    equ 0000h
T2CON_T2CKPS_SIZE                        equ 0002h
T2CON_T2CKPS_LENGTH                      equ 0002h
T2CON_T2CKPS_MASK                        equ 0003h
T2CON_TMR2ON_POSN                        equ 0002h
T2CON_TMR2ON_POSITION                    equ 0002h
T2CON_TMR2ON_SIZE                        equ 0001h
T2CON_TMR2ON_LENGTH                      equ 0001h
T2CON_TMR2ON_MASK                        equ 0004h
T2CON_TOUTPS_POSN                        equ 0003h
T2CON_TOUTPS_POSITION                    equ 0003h
T2CON_TOUTPS_SIZE                        equ 0004h
T2CON_TOUTPS_LENGTH                      equ 0004h
T2CON_TOUTPS_MASK                        equ 0078h
T2CON_T2CKPS0_POSN                       equ 0000h
T2CON_T2CKPS0_POSITION                   equ 0000h
T2CON_T2CKPS0_SIZE                       equ 0001h
T2CON_T2CKPS0_LENGTH                     equ 0001h
T2CON_T2CKPS0_MASK                       equ 0001h
T2CON_T2CKPS1_POSN                       equ 0001h
T2CON_T2CKPS1_POSITION                   equ 0001h
T2CON_T2CKPS1_SIZE                       equ 0001h
T2CON_T2CKPS1_LENGTH                     equ 0001h
T2CON_T2CKPS1_MASK                       equ 0002h
T2CON_T2OUTPS0_POSN                      equ 0003h
T2CON_T2OUTPS0_POSITION                  equ 0003h
T2CON_T2OUTPS0_SIZE                      equ 0001h
T2CON_T2OUTPS0_LENGTH                    equ 0001h
T2CON_T2OUTPS0_MASK                      equ 0008h
T2CON_T2OUTPS1_POSN                      equ 0004h
T2CON_T2OUTPS1_POSITION                  equ 0004h
T2CON_T2OUTPS1_SIZE                      equ 0001h
T2CON_T2OUTPS1_LENGTH                    equ 0001h
T2CON_T2OUTPS1_MASK                      equ 0010h
T2CON_T2OUTPS2_POSN                      equ 0005h
T2CON_T2OUTPS2_POSITION                  equ 0005h
T2CON_T2OUTPS2_SIZE                      equ 0001h
T2CON_T2OUTPS2_LENGTH                    equ 0001h
T2CON_T2OUTPS2_MASK                      equ 0020h
T2CON_T2OUTPS3_POSN                      equ 0006h
T2CON_T2OUTPS3_POSITION                  equ 0006h
T2CON_T2OUTPS3_SIZE                      equ 0001h
T2CON_T2OUTPS3_LENGTH                    equ 0001h
T2CON_T2OUTPS3_MASK                      equ 0040h

// Register: PR2
#define PR2 PR2
PR2                                      equ 0FCBh
// bitfield definitions
PR2_EBDIS_POSN                           equ 0007h
PR2_EBDIS_POSITION                       equ 0007h
PR2_EBDIS_SIZE                           equ 0001h
PR2_EBDIS_LENGTH                         equ 0001h
PR2_EBDIS_MASK                           equ 0080h
PR2_WAIT0_POSN                           equ 0004h
PR2_WAIT0_POSITION                       equ 0004h
PR2_WAIT0_SIZE                           equ 0001h
PR2_WAIT0_LENGTH                         equ 0001h
PR2_WAIT0_MASK                           equ 0010h
PR2_WAIT1_POSN                           equ 0005h
PR2_WAIT1_POSITION                       equ 0005h
PR2_WAIT1_SIZE                           equ 0001h
PR2_WAIT1_LENGTH                         equ 0001h
PR2_WAIT1_MASK                           equ 0020h
PR2_WM0_POSN                             equ 0000h
PR2_WM0_POSITION                         equ 0000h
PR2_WM0_SIZE                             equ 0001h
PR2_WM0_LENGTH                           equ 0001h
PR2_WM0_MASK                             equ 0001h
PR2_WM1_POSN                             equ 0001h
PR2_WM1_POSITION                         equ 0001h
PR2_WM1_SIZE                             equ 0001h
PR2_WM1_LENGTH                           equ 0001h
PR2_WM1_MASK                             equ 0002h

// Register: TMR2
#define TMR2 TMR2
TMR2                                     equ 0FCCh

// Register: PADCFG1
#define PADCFG1 PADCFG1
PADCFG1                                  equ 0FCCh
// bitfield definitions
PADCFG1_PMPTL_POSN                       equ 0000h
PADCFG1_PMPTL_POSITION                   equ 0000h
PADCFG1_PMPTL_SIZE                       equ 0001h
PADCFG1_PMPTL_LENGTH                     equ 0001h
PADCFG1_PMPTL_MASK                       equ 0001h
PADCFG1_PMPTTL_POSN                      equ 0000h
PADCFG1_PMPTTL_POSITION                  equ 0000h
PADCFG1_PMPTTL_SIZE                      equ 0001h
PADCFG1_PMPTTL_LENGTH                    equ 0001h
PADCFG1_PMPTTL_MASK                      equ 0001h

// Register: T1CON
#define T1CON T1CON
T1CON                                    equ 0FCDh
// bitfield definitions
T1CON_NOT_T1SYNC_POSN                    equ 0002h
T1CON_NOT_T1SYNC_POSITION                equ 0002h
T1CON_NOT_T1SYNC_SIZE                    equ 0001h
T1CON_NOT_T1SYNC_LENGTH                  equ 0001h
T1CON_NOT_T1SYNC_MASK                    equ 0004h
T1CON_TMR1ON_POSN                        equ 0000h
T1CON_TMR1ON_POSITION                    equ 0000h
T1CON_TMR1ON_SIZE                        equ 0001h
T1CON_TMR1ON_LENGTH                      equ 0001h
T1CON_TMR1ON_MASK                        equ 0001h
T1CON_TMR1CS_POSN                        equ 0001h
T1CON_TMR1CS_POSITION                    equ 0001h
T1CON_TMR1CS_SIZE                        equ 0001h
T1CON_TMR1CS_LENGTH                      equ 0001h
T1CON_TMR1CS_MASK                        equ 0002h
T1CON_nT1SYNC_POSN                       equ 0002h
T1CON_nT1SYNC_POSITION                   equ 0002h
T1CON_nT1SYNC_SIZE                       equ 0001h
T1CON_nT1SYNC_LENGTH                     equ 0001h
T1CON_nT1SYNC_MASK                       equ 0004h
T1CON_T1OSCEN_POSN                       equ 0003h
T1CON_T1OSCEN_POSITION                   equ 0003h
T1CON_T1OSCEN_SIZE                       equ 0001h
T1CON_T1OSCEN_LENGTH                     equ 0001h
T1CON_T1OSCEN_MASK                       equ 0008h
T1CON_T1CKPS_POSN                        equ 0004h
T1CON_T1CKPS_POSITION                    equ 0004h
T1CON_T1CKPS_SIZE                        equ 0002h
T1CON_T1CKPS_LENGTH                      equ 0002h
T1CON_T1CKPS_MASK                        equ 0030h
T1CON_T1RUN_POSN                         equ 0006h
T1CON_T1RUN_POSITION                     equ 0006h
T1CON_T1RUN_SIZE                         equ 0001h
T1CON_T1RUN_LENGTH                       equ 0001h
T1CON_T1RUN_MASK                         equ 0040h
T1CON_RD16_POSN                          equ 0007h
T1CON_RD16_POSITION                      equ 0007h
T1CON_RD16_SIZE                          equ 0001h
T1CON_RD16_LENGTH                        equ 0001h
T1CON_RD16_MASK                          equ 0080h
T1CON_T1SYNC_POSN                        equ 0002h
T1CON_T1SYNC_POSITION                    equ 0002h
T1CON_T1SYNC_SIZE                        equ 0001h
T1CON_T1SYNC_LENGTH                      equ 0001h
T1CON_T1SYNC_MASK                        equ 0004h
T1CON_T1CKPS0_POSN                       equ 0004h
T1CON_T1CKPS0_POSITION                   equ 0004h
T1CON_T1CKPS0_SIZE                       equ 0001h
T1CON_T1CKPS0_LENGTH                     equ 0001h
T1CON_T1CKPS0_MASK                       equ 0010h
T1CON_T1CKPS1_POSN                       equ 0005h
T1CON_T1CKPS1_POSITION                   equ 0005h
T1CON_T1CKPS1_SIZE                       equ 0001h
T1CON_T1CKPS1_LENGTH                     equ 0001h
T1CON_T1CKPS1_MASK                       equ 0020h
T1CON_T1INSYNC_POSN                      equ 0002h
T1CON_T1INSYNC_POSITION                  equ 0002h
T1CON_T1INSYNC_SIZE                      equ 0001h
T1CON_T1INSYNC_LENGTH                    equ 0001h
T1CON_T1INSYNC_MASK                      equ 0004h
T1CON_SOSCEN_POSN                        equ 0003h
T1CON_SOSCEN_POSITION                    equ 0003h
T1CON_SOSCEN_SIZE                        equ 0001h
T1CON_SOSCEN_LENGTH                      equ 0001h
T1CON_SOSCEN_MASK                        equ 0008h
T1CON_T1RD16_POSN                        equ 0007h
T1CON_T1RD16_POSITION                    equ 0007h
T1CON_T1RD16_SIZE                        equ 0001h
T1CON_T1RD16_LENGTH                      equ 0001h
T1CON_T1RD16_MASK                        equ 0080h

// Register: ODCON3
#define ODCON3 ODCON3
ODCON3                                   equ 0FCDh
// bitfield definitions
ODCON3_SPI1OD_POSN                       equ 0000h
ODCON3_SPI1OD_POSITION                   equ 0000h
ODCON3_SPI1OD_SIZE                       equ 0001h
ODCON3_SPI1OD_LENGTH                     equ 0001h
ODCON3_SPI1OD_MASK                       equ 0001h
ODCON3_SPI2OD_POSN                       equ 0001h
ODCON3_SPI2OD_POSITION                   equ 0001h
ODCON3_SPI2OD_SIZE                       equ 0001h
ODCON3_SPI2OD_LENGTH                     equ 0001h
ODCON3_SPI2OD_MASK                       equ 0002h

// Register: TMR1
#define TMR1 TMR1
TMR1                                     equ 0FCEh

// Register: TMR1L
#define TMR1L TMR1L
TMR1L                                    equ 0FCEh

// Register: ODCON2
#define ODCON2 ODCON2
ODCON2                                   equ 0FCEh
// bitfield definitions
ODCON2_USART1OD_POSN                     equ 0000h
ODCON2_USART1OD_POSITION                 equ 0000h
ODCON2_USART1OD_SIZE                     equ 0001h
ODCON2_USART1OD_LENGTH                   equ 0001h
ODCON2_USART1OD_MASK                     equ 0001h
ODCON2_USART2OD_POSN                     equ 0001h
ODCON2_USART2OD_POSITION                 equ 0001h
ODCON2_USART2OD_SIZE                     equ 0001h
ODCON2_USART2OD_LENGTH                   equ 0001h
ODCON2_USART2OD_MASK                     equ 0002h
ODCON2_U1OD_POSN                         equ 0000h
ODCON2_U1OD_POSITION                     equ 0000h
ODCON2_U1OD_SIZE                         equ 0001h
ODCON2_U1OD_LENGTH                       equ 0001h
ODCON2_U1OD_MASK                         equ 0001h
ODCON2_U2OD_POSN                         equ 0001h
ODCON2_U2OD_POSITION                     equ 0001h
ODCON2_U2OD_SIZE                         equ 0001h
ODCON2_U2OD_LENGTH                       equ 0001h
ODCON2_U2OD_MASK                         equ 0002h

// Register: TMR1H
#define TMR1H TMR1H
TMR1H                                    equ 0FCFh

// Register: ODCON1
#define ODCON1 ODCON1
ODCON1                                   equ 0FCFh
// bitfield definitions
ODCON1_ECCP1OD_POSN                      equ 0000h
ODCON1_ECCP1OD_POSITION                  equ 0000h
ODCON1_ECCP1OD_SIZE                      equ 0001h
ODCON1_ECCP1OD_LENGTH                    equ 0001h
ODCON1_ECCP1OD_MASK                      equ 0001h
ODCON1_ECCP2OD_POSN                      equ 0001h
ODCON1_ECCP2OD_POSITION                  equ 0001h
ODCON1_ECCP2OD_SIZE                      equ 0001h
ODCON1_ECCP2OD_LENGTH                    equ 0001h
ODCON1_ECCP2OD_MASK                      equ 0002h
ODCON1_ECCP3OD_POSN                      equ 0002h
ODCON1_ECCP3OD_POSITION                  equ 0002h
ODCON1_ECCP3OD_SIZE                      equ 0001h
ODCON1_ECCP3OD_LENGTH                    equ 0001h
ODCON1_ECCP3OD_MASK                      equ 0004h
ODCON1_CCP4OD_POSN                       equ 0003h
ODCON1_CCP4OD_POSITION                   equ 0003h
ODCON1_CCP4OD_SIZE                       equ 0001h
ODCON1_CCP4OD_LENGTH                     equ 0001h
ODCON1_CCP4OD_MASK                       equ 0008h
ODCON1_CCP5OD_POSN                       equ 0004h
ODCON1_CCP5OD_POSITION                   equ 0004h
ODCON1_CCP5OD_SIZE                       equ 0001h
ODCON1_CCP5OD_LENGTH                     equ 0001h
ODCON1_CCP5OD_MASK                       equ 0010h

// Register: RCON
#define RCON RCON
RCON                                     equ 0FD0h
// bitfield definitions
RCON_NOT_BOR_POSN                        equ 0000h
RCON_NOT_BOR_POSITION                    equ 0000h
RCON_NOT_BOR_SIZE                        equ 0001h
RCON_NOT_BOR_LENGTH                      equ 0001h
RCON_NOT_BOR_MASK                        equ 0001h
RCON_NOT_POR_POSN                        equ 0001h
RCON_NOT_POR_POSITION                    equ 0001h
RCON_NOT_POR_SIZE                        equ 0001h
RCON_NOT_POR_LENGTH                      equ 0001h
RCON_NOT_POR_MASK                        equ 0002h
RCON_NOT_PD_POSN                         equ 0002h
RCON_NOT_PD_POSITION                     equ 0002h
RCON_NOT_PD_SIZE                         equ 0001h
RCON_NOT_PD_LENGTH                       equ 0001h
RCON_NOT_PD_MASK                         equ 0004h
RCON_NOT_TO_POSN                         equ 0003h
RCON_NOT_TO_POSITION                     equ 0003h
RCON_NOT_TO_SIZE                         equ 0001h
RCON_NOT_TO_LENGTH                       equ 0001h
RCON_NOT_TO_MASK                         equ 0008h
RCON_NOT_RI_POSN                         equ 0004h
RCON_NOT_RI_POSITION                     equ 0004h
RCON_NOT_RI_SIZE                         equ 0001h
RCON_NOT_RI_LENGTH                       equ 0001h
RCON_NOT_RI_MASK                         equ 0010h
RCON_NOT_CM_POSN                         equ 0005h
RCON_NOT_CM_POSITION                     equ 0005h
RCON_NOT_CM_SIZE                         equ 0001h
RCON_NOT_CM_LENGTH                       equ 0001h
RCON_NOT_CM_MASK                         equ 0020h
RCON_nBOR_POSN                           equ 0000h
RCON_nBOR_POSITION                       equ 0000h
RCON_nBOR_SIZE                           equ 0001h
RCON_nBOR_LENGTH                         equ 0001h
RCON_nBOR_MASK                           equ 0001h
RCON_nPOR_POSN                           equ 0001h
RCON_nPOR_POSITION                       equ 0001h
RCON_nPOR_SIZE                           equ 0001h
RCON_nPOR_LENGTH                         equ 0001h
RCON_nPOR_MASK                           equ 0002h
RCON_nPD_POSN                            equ 0002h
RCON_nPD_POSITION                        equ 0002h
RCON_nPD_SIZE                            equ 0001h
RCON_nPD_LENGTH                          equ 0001h
RCON_nPD_MASK                            equ 0004h
RCON_nTO_POSN                            equ 0003h
RCON_nTO_POSITION                        equ 0003h
RCON_nTO_SIZE                            equ 0001h
RCON_nTO_LENGTH                          equ 0001h
RCON_nTO_MASK                            equ 0008h
RCON_nRI_POSN                            equ 0004h
RCON_nRI_POSITION                        equ 0004h
RCON_nRI_SIZE                            equ 0001h
RCON_nRI_LENGTH                          equ 0001h
RCON_nRI_MASK                            equ 0010h
RCON_nCM_POSN                            equ 0005h
RCON_nCM_POSITION                        equ 0005h
RCON_nCM_SIZE                            equ 0001h
RCON_nCM_LENGTH                          equ 0001h
RCON_nCM_MASK                            equ 0020h
RCON_IPEN_POSN                           equ 0007h
RCON_IPEN_POSITION                       equ 0007h
RCON_IPEN_SIZE                           equ 0001h
RCON_IPEN_LENGTH                         equ 0001h
RCON_IPEN_MASK                           equ 0080h
RCON_BOR_POSN                            equ 0000h
RCON_BOR_POSITION                        equ 0000h
RCON_BOR_SIZE                            equ 0001h
RCON_BOR_LENGTH                          equ 0001h
RCON_BOR_MASK                            equ 0001h
RCON_POR_POSN                            equ 0001h
RCON_POR_POSITION                        equ 0001h
RCON_POR_SIZE                            equ 0001h
RCON_POR_LENGTH                          equ 0001h
RCON_POR_MASK                            equ 0002h
RCON_PD_POSN                             equ 0002h
RCON_PD_POSITION                         equ 0002h
RCON_PD_SIZE                             equ 0001h
RCON_PD_LENGTH                           equ 0001h
RCON_PD_MASK                             equ 0004h
RCON_TO_POSN                             equ 0003h
RCON_TO_POSITION                         equ 0003h
RCON_TO_SIZE                             equ 0001h
RCON_TO_LENGTH                           equ 0001h
RCON_TO_MASK                             equ 0008h
RCON_RI_POSN                             equ 0004h
RCON_RI_POSITION                         equ 0004h
RCON_RI_SIZE                             equ 0001h
RCON_RI_LENGTH                           equ 0001h
RCON_RI_MASK                             equ 0010h
RCON_CM_POSN                             equ 0005h
RCON_CM_POSITION                         equ 0005h
RCON_CM_SIZE                             equ 0001h
RCON_CM_LENGTH                           equ 0001h
RCON_CM_MASK                             equ 0020h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0FD1h
// bitfield definitions
CM2CON1_CCH_POSN                         equ 0000h
CM2CON1_CCH_POSITION                     equ 0000h
CM2CON1_CCH_SIZE                         equ 0002h
CM2CON1_CCH_LENGTH                       equ 0002h
CM2CON1_CCH_MASK                         equ 0003h
CM2CON1_CREF_POSN                        equ 0002h
CM2CON1_CREF_POSITION                    equ 0002h
CM2CON1_CREF_SIZE                        equ 0001h
CM2CON1_CREF_LENGTH                      equ 0001h
CM2CON1_CREF_MASK                        equ 0004h
CM2CON1_EVPOL_POSN                       equ 0003h
CM2CON1_EVPOL_POSITION                   equ 0003h
CM2CON1_EVPOL_SIZE                       equ 0002h
CM2CON1_EVPOL_LENGTH                     equ 0002h
CM2CON1_EVPOL_MASK                       equ 0018h
CM2CON1_CPOL_POSN                        equ 0005h
CM2CON1_CPOL_POSITION                    equ 0005h
CM2CON1_CPOL_SIZE                        equ 0001h
CM2CON1_CPOL_LENGTH                      equ 0001h
CM2CON1_CPOL_MASK                        equ 0020h
CM2CON1_COE_POSN                         equ 0006h
CM2CON1_COE_POSITION                     equ 0006h
CM2CON1_COE_SIZE                         equ 0001h
CM2CON1_COE_LENGTH                       equ 0001h
CM2CON1_COE_MASK                         equ 0040h
CM2CON1_CON_POSN                         equ 0007h
CM2CON1_CON_POSITION                     equ 0007h
CM2CON1_CON_SIZE                         equ 0001h
CM2CON1_CON_LENGTH                       equ 0001h
CM2CON1_CON_MASK                         equ 0080h
CM2CON1_C1CH0_POSN                       equ 0000h
CM2CON1_C1CH0_POSITION                   equ 0000h
CM2CON1_C1CH0_SIZE                       equ 0001h
CM2CON1_C1CH0_LENGTH                     equ 0001h
CM2CON1_C1CH0_MASK                       equ 0001h
CM2CON1_C1CH1_POSN                       equ 0001h
CM2CON1_C1CH1_POSITION                   equ 0001h
CM2CON1_C1CH1_SIZE                       equ 0001h
CM2CON1_C1CH1_LENGTH                     equ 0001h
CM2CON1_C1CH1_MASK                       equ 0002h
CM2CON1_EVPOL0_POSN                      equ 0003h
CM2CON1_EVPOL0_POSITION                  equ 0003h
CM2CON1_EVPOL0_SIZE                      equ 0001h
CM2CON1_EVPOL0_LENGTH                    equ 0001h
CM2CON1_EVPOL0_MASK                      equ 0008h
CM2CON1_EVPOL1_POSN                      equ 0004h
CM2CON1_EVPOL1_POSITION                  equ 0004h
CM2CON1_EVPOL1_SIZE                      equ 0001h
CM2CON1_EVPOL1_LENGTH                    equ 0001h
CM2CON1_EVPOL1_MASK                      equ 0010h
CM2CON1_CCH0_POSN                        equ 0000h
CM2CON1_CCH0_POSITION                    equ 0000h
CM2CON1_CCH0_SIZE                        equ 0001h
CM2CON1_CCH0_LENGTH                      equ 0001h
CM2CON1_CCH0_MASK                        equ 0001h
CM2CON1_CCH1_POSN                        equ 0001h
CM2CON1_CCH1_POSITION                    equ 0001h
CM2CON1_CCH1_SIZE                        equ 0001h
CM2CON1_CCH1_LENGTH                      equ 0001h
CM2CON1_CCH1_MASK                        equ 0002h
CM2CON1_CCH02_POSN                       equ 0000h
CM2CON1_CCH02_POSITION                   equ 0000h
CM2CON1_CCH02_SIZE                       equ 0001h
CM2CON1_CCH02_LENGTH                     equ 0001h
CM2CON1_CCH02_MASK                       equ 0001h
CM2CON1_CCH12_POSN                       equ 0001h
CM2CON1_CCH12_POSITION                   equ 0001h
CM2CON1_CCH12_SIZE                       equ 0001h
CM2CON1_CCH12_LENGTH                     equ 0001h
CM2CON1_CCH12_MASK                       equ 0002h
CM2CON1_COE2_POSN                        equ 0006h
CM2CON1_COE2_POSITION                    equ 0006h
CM2CON1_COE2_SIZE                        equ 0001h
CM2CON1_COE2_LENGTH                      equ 0001h
CM2CON1_COE2_MASK                        equ 0040h
CM2CON1_CON2_POSN                        equ 0007h
CM2CON1_CON2_POSITION                    equ 0007h
CM2CON1_CON2_SIZE                        equ 0001h
CM2CON1_CON2_LENGTH                      equ 0001h
CM2CON1_CON2_MASK                        equ 0080h
CM2CON1_CPOL2_POSN                       equ 0005h
CM2CON1_CPOL2_POSITION                   equ 0005h
CM2CON1_CPOL2_SIZE                       equ 0001h
CM2CON1_CPOL2_LENGTH                     equ 0001h
CM2CON1_CPOL2_MASK                       equ 0020h
CM2CON1_CREF2_POSN                       equ 0002h
CM2CON1_CREF2_POSITION                   equ 0002h
CM2CON1_CREF2_SIZE                       equ 0001h
CM2CON1_CREF2_LENGTH                     equ 0001h
CM2CON1_CREF2_MASK                       equ 0004h
CM2CON1_EVPOL02_POSN                     equ 0003h
CM2CON1_EVPOL02_POSITION                 equ 0003h
CM2CON1_EVPOL02_SIZE                     equ 0001h
CM2CON1_EVPOL02_LENGTH                   equ 0001h
CM2CON1_EVPOL02_MASK                     equ 0008h
CM2CON1_EVPOL12_POSN                     equ 0004h
CM2CON1_EVPOL12_POSITION                 equ 0004h
CM2CON1_EVPOL12_SIZE                     equ 0001h
CM2CON1_EVPOL12_LENGTH                   equ 0001h
CM2CON1_EVPOL12_MASK                     equ 0010h

